#### Terraform Format and Style 🖌`success`
#### dev - Terraform Initialization ⚙️`success`
#### dev - Terraform Validation 🤖Success! The configuration is valid.


#### dev - Terraform Plan 📖`success`

<details><summary>dev - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.core-infrastructure.module.k8s-master.data.google_project.project: Refreshing state... [id=projects/broad-cda-dev]
module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions: Refreshing state... [id=2020-12-09 18:06:48.413774749 +0000 UTC]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/broad-cda-dev/global/securityPolicies/broad-cloud-armor]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/broad-cda-dev/global/sslPolicies/global-ssl-policy]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=broad-cda-dev/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=broad-cda-dev/serviceusage.googleapis.com]
module.cda-app.data.google_dns_managed_zone.dns_zone[0]: Refreshing state... [id=projects/broad-cda-dev/managedZones/cda-dev]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=broad-cda-dev/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=broad-cda-dev/logging.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=broad-cda-dev/compute.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=broad-cda-dev/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=broad-cda-dev/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=broad-cda-dev/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=broad-cda-dev/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=broad-cda-dev/dns.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=broad-cda-dev/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=broad-cda-dev/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=broad-cda-dev/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=broad-cda-dev/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=broad-cda-dev/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=broad-cda-dev/container.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=broad-cda-dev/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=broad-cda-dev/sql-component.googleapis.com]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/broad-cda-dev/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/broad-cda-dev/global/networks/dev-network]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/broad-cda-dev/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_dns_managed_zone.dns_zone[0]: Refreshing state... [id=projects/broad-cda-dev/managedZones/cda-dev]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/broad-cda-dev/regions/us-central1/subnetworks/dev-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/broad-cda-dev/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/broad-cda-dev/locations/us-central1/clusters/cda-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=broad-cda-dev/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-nodes["cda-node-us-central-1"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/broad-cda-dev/locations/us-central1/clusters/cda-master-us-central1/nodePools/cda-node-us-central-1]
module.cda-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/broad-cda-dev/global/addresses/cda-dev-ip]
module.cda-app.google_dns_record_set.a_dns[0]: Refreshing state... [id=cda-dev/cda-global.cda-dev.broadinstitute.org./A]
module.cda-app.google_dns_record_set.cname_dns[0]: Refreshing state... [id=cda-dev/cda.cda-dev.broadinstitute.org./CNAME]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cda-app.google_project_iam_member.service-account-role["roles/bigquery.admin"] will be created
  + resource "google_project_iam_member" "service-account-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-cda-dev"
      + role    = "roles/bigquery.admin"
    }

  # module.cda-app.google_service_account.service-account will be created
  + resource "google_service_account" "service-account" {
      + account_id   = "bq-cda-sa"
      + display_name = "bq-cda-sa"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.cda-app.google_service_account_iam_binding.workload-identity-binding will be created
  + resource "google_service_account_iam_binding" "workload-identity-binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:broad-cda-dev.svc.id.goog[cda-dev/cda]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.cda-app.google_service_account_key.service-account-key will be created
  + resource "google_service_account_key" "service-account-key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.core-infrastructure.module.k8s-master.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        cluster_ipv4_cidr           = "10.127.0.0/20"
        default_max_pods_per_node   = 110
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
        endpoint                    = "34.66.86.167"
        id                          = "projects/broad-cda-dev/locations/us-central1/clusters/cda-master-us-central1"
        initial_node_count          = 1
        instance_group_urls         = [
            "https://www.googleapis.com/compute/beta/projects/broad-cda-dev/zones/us-central1-f/instanceGroups/gke-cda-master-us-ce-cda-node-us-cent-032e5388-grp",
            "https://www.googleapis.com/compute/beta/projects/broad-cda-dev/zones/us-central1-b/instanceGroups/gke-cda-master-us-ce-cda-node-us-cent-17c556c1-grp",
            "https://www.googleapis.com/compute/beta/projects/broad-cda-dev/zones/us-central1-a/instanceGroups/gke-cda-master-us-ce-cda-node-us-cent-bda88a0c-grp",
        ]
        label_fingerprint           = "a9dc16a7"
        location                    = "us-central1"
        logging_service             = "logging.googleapis.com/kubernetes"
        master_version              = "1.17.13-gke.2001"
      ~ min_master_version          = "1.17.13-gke.1400" -> "1.17.13-gke.2001"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "cda-master-us-central1"
        network                     = "projects/broad-cda-dev/global/networks/dev-network"
        networking_mode             = "VPC_NATIVE"
        node_locations              = [
            "us-central1-a",
            "us-central1-b",
            "us-central1-f",
        ]
        node_version                = "1.17.13-gke.2001"
        project                     = "broad-cda-dev"
        remove_default_node_pool    = true
        resource_labels             = {}
        self_link                   = "https://container.googleapis.com/v1beta1/projects/broad-cda-dev/locations/us-central1/clusters/cda-master-us-central1"
        services_ipv4_cidr          = "10.0.16.0/20"
        subnetwork                  = "projects/broad-cda-dev/regions/us-central1/subnetworks/dev-subnet"

        addons_config {

            istio_config {
                disabled = true
            }

            network_policy_config {
                disabled = false
            }
        }

        cluster_autoscaling {
            autoscaling_profile = "BALANCED"
            enabled             = false
        }

        cluster_telemetry {
            type = "ENABLED"
        }

        database_encryption {
            state = "DECRYPTED"
        }

        default_snat_status {
            disabled = false
        }

        ip_allocation_policy {
            cluster_ipv4_cidr_block       = "10.127.0.0/20"
            cluster_secondary_range_name  = "pods"
            services_ipv4_cidr_block      = "10.0.16.0/20"
            services_secondary_range_name = "services"
        }

        master_auth {
            client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMrekNDQWVPZ0F3SUJBZ0lRQnZudW82RGJ3K2VyNFlqeGlZRUxSakFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlReFptSTFNVFpqTUMwM1lURTJMVFF5TWpjdFltTTVNeTA0TjJVek1ESTVNalZpTldRdwpIaGNOTWpBeE1USXpNVGcwTkRJNVdoY05NalV4TVRJeU1UZzBOREk1V2pBUk1ROHdEUVlEVlFRREV3WmpiR2xsCmJuUXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFEUzk0OWR5bk9vdlRFd01hZUYKOC8zQWRqMEY2Z1VadGIvVS9YMTBhVW5jYkxRUWpmdzRwOTNGYnIxeW8xQUtmOWxNWUFKTVBKTmtWNnc2UTNwbAo0OWczdkZ0LzU5Y0s5SjhVNkFMU3FrMEV0WGtHdEd3a3lGK1BNVGhiMEZQcXRuQ0pGNmJLYlZ5SlZKajhJYnpMCkdKdTE5bGpJSy9jN3ROK01IeE5WQmxIcVBaUllJbVI5bWZqQUJXNnMzRnB2U1NIQitjeDRPenRuQldOZWFVV3oKcVJFM214ejJQUGN5TCsrMmdVZnEvd3BhdFFOWndRTXkycmNqM2Z4bVdzbHlKNXJua3c0Kzl5QXd6TVFkamJGMAp0UmhOVVBzTzBjRy9zT0ZXR2lTZFFjRTdxdmFnTmJGQStvd0VOaWdnR085WjlkbSs2L004VTF5UmtIQlJyVWkyClZxRUxBZ01CQUFHak1UQXZNQXdHQTFVZEV3RUIvd1FDTUFBd0h3WURWUjBqQkJnd0ZvQVVzc0JvS0M4dkxWcEYKM3h3dHNRYWk5V3JhQ0dJd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFCQk1GY2EyWEs1ajVHWG5Jam55ZlJ0egphalJnREF5aWVMR2thb3h5MnRmMjJkZmFiempEZGlDeHR0b1BJUVdJdkxUT2I2dE5QNFNBZEVUdGlJUkV3RkJjClROMVozZUQvVUQ1Z3FvTDhDS1RjTFBMRk0zOGpiSFlIZitRUFcvejl4bGxMMDhXKzJKeFU4VFFpMm5vR00xVTAKSnNIZE9wMnNaSUl6U3Y3K2xSZzE4V0tyMHl4K2RSS2lOMEJ6azRZazByWCtmSnd3amdHNG9pYUk0SHkvOXR6bQpyeEZEaDlqK1kzZWRsRldsZTZVZHBWTEpac1Y4YXpEOGMrczVrMzFlRlVnSjNkWHV4Zm9xa0tiV3EzUTBUU2c3Ck9sdkljN3VDUks5Q0d1RysrY3B5cGN4dDYrSTZlOXcvQTYyN21sWlNkbFJvRnhhaEgwU0FQWVdabWsvVkw1ST0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
            client_key             = (sensitive value)
            cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURLekNDQWhPZ0F3SUJBZ0lSQU13M0RGbjdOZkY3Wm5BL1NKaTI4T013RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa01XWmlOVEUyWXpBdE4yRXhOaTAwTWpJM0xXSmpPVE10T0RkbE16QXlPVEkxWWpWawpNQjRYRFRJd01URXlNekUzTkRReU9Wb1hEVEkxTVRFeU1qRTRORFF5T1Zvd0x6RXRNQ3NHQTFVRUF4TWtNV1ppCk5URTJZekF0TjJFeE5pMDBNakkzTFdKak9UTXRPRGRsTXpBeU9USTFZalZrTUlJQklqQU5CZ2txaGtpRzl3MEIKQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBelRUOWRZZW9LR3NNTWcrV3NoUUdheUhEOEU5Sld1UVl5WktkK3M0TwpPRGxVZ3p3QWFPUTRTZ0N6MTQ1WXBaZy9PY3FCZVBTdXBjckhHYVBNVDkvMjFINVlkWDlvUnE4NHJwS0dMUjN0Ci9UVS82VFpmMjkxYU9iVXovdDdyaDB3ZVpKbXZqYnJvRHNkN3ZYU2FlVDNXTjQzVDBYZDFLdkh5aFNSejdLWVUKQldNSXdHUzNweHJsMHI5YWxKTTAxZzFxYzNwVlVxUURkYllXZDZLOGdLdTF3anRNbnJ4Rkd2UVg0QUwyNDRGRgpRbDQ3cnl6akRnZFliRnJxVW00czg4WnZ2SXJpNWtnNVNpcGF4aDFaMTRzTGJzcFhiK0xBamJtU3BraGZOL0NnCnRBcnBvUTE4VUdzQ1RXUzI3bEZNa0tQeG9leDBxd01WODRtUkRlUmlObjFkVlFJREFRQUJvMEl3UURBT0JnTlYKSFE4QkFmOEVCQU1DQWdRd0R3WURWUjBUQVFIL0JBVXdBd0VCL3pBZEJnTlZIUTRFRmdRVXNzQm9LQzh2TFZwRgozeHd0c1FhaTlXcmFDR0l3RFFZSktvWklodmNOQVFFTEJRQURnZ0VCQUVYKytjallyZnBOS0VRSmlQeDRtODdjClVqZTNBM21jclg3NFQ1c0wzNmQxTDMrL2JMUktQOGtDWEF1bnViUVg0NDJUMWR1OWo2Zm5vdktUZ0VLL3hSWU8KU2l4RnRrcjRpVDYxT0x2UVAwWFZRclV5S3lLWVh2dXlxSzE4RlJ5VWRJQUY2djRuWGtVUEdNbUw1MHVjakFoaQpJZ3dHRVlHY2VuSXA4TytRSHU1cE5KV0xNcFJtK21IeXBWekVuNFozS2l3YWZnWEhUSzVqbnJVL0wrN2JwWkpMCkZPMUZiQnNSaWpjMDdNbHVWaU5oRjFPbHJjbko4aldiRkdkRGRteEhtdlZ5MURlTTA0L3RUdDJFNEVNekFsSzYKcVZuMWJTc0NMV2twWCszd3BWVm9uUm5mL3RxRDVlQ29leldDZ0xjdXlhUHlsWHZBRmMvQWh1eDNwMTJCbzVFPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="

            client_certificate_config {
                issue_client_certificate = true
            }
        }

        network_policy {
            enabled = true
        }

        node_config {
            disk_size_gb      = 50
            disk_type         = "pd-standard"
            guest_accelerator = []
            image_type        = "COS"
            labels            = {
                "environment" = "cda"
                "project"     = "broad-cda-dev"
            }
            local_ssd_count   = 0
            machine_type      = "n1-standard-2"
            metadata          = {
                "disable-legacy-endpoints"         = "true"
                "google-compute-enable-virtio-rng" = "false"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = false
            service_account   = "default"
            tags              = [
                "broad-cda-dev",
                "cda",
                "kubernetes",
            ]
            taint             = []

            shielded_instance_config {
                enable_integrity_monitoring = true
                enable_secure_boot          = false
            }

            workload_metadata_config {
                node_metadata = "GKE_METADATA_SERVER"
            }
        }

        node_pool {
            initial_node_count  = 1
            instance_group_urls = [
                "https://www.googleapis.com/compute/v1/projects/broad-cda-dev/zones/us-central1-f/instanceGroupManagers/gke-cda-master-us-ce-cda-node-us-cent-032e5388-grp",
                "https://www.googleapis.com/compute/v1/projects/broad-cda-dev/zones/us-central1-b/instanceGroupManagers/gke-cda-master-us-ce-cda-node-us-cent-17c556c1-grp",
                "https://www.googleapis.com/compute/v1/projects/broad-cda-dev/zones/us-central1-a/instanceGroupManagers/gke-cda-master-us-ce-cda-node-us-cent-bda88a0c-grp",
            ]
            max_pods_per_node   = 110
            name                = "cda-node-us-central-1"
            node_count          = 1
            node_locations      = [
                "us-central1-a",
                "us-central1-b",
                "us-central1-f",
            ]
            version             = "1.17.13-gke.2001"

            management {
                auto_repair  = true
                auto_upgrade = true
            }

            node_config {
                disk_size_gb      = 50
                disk_type         = "pd-standard"
                guest_accelerator = []
                image_type        = "COS"
                labels            = {
                    "environment" = "cda"
                    "project"     = "broad-cda-dev"
                }
                local_ssd_count   = 0
                machine_type      = "n1-standard-2"
                metadata          = {
                    "disable-legacy-endpoints"         = "true"
                    "google-compute-enable-virtio-rng" = "false"
                }
                oauth_scopes      = [
                    "https://www.googleapis.com/auth/compute",
                    "https://www.googleapis.com/auth/devstorage.read_only",
                    "https://www.googleapis.com/auth/logging.write",
                    "https://www.googleapis.com/auth/monitoring",
                ]
                preemptible       = false
                service_account   = "default"
                tags              = [
                    "broad-cda-dev",
                    "cda",
                    "kubernetes",
                ]
                taint             = []

                shielded_instance_config {
                    enable_integrity_monitoring = true
                    enable_secure_boot          = false
                }

                workload_metadata_config {
                    node_metadata = "GKE_METADATA_SERVER"
                }
            }

            upgrade_settings {
                max_surge       = 1
                max_unavailable = 0
            }
        }

        notification_config {
            pubsub {
                enabled = false
            }
        }

        pod_security_policy_config {
            enabled = true
        }

        private_cluster_config {
            enable_private_endpoint = false
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.227.0.0/28"
            peering_name            = "gke-nc8d19384d5a27520603-bd7a-6015-peer"
            private_endpoint        = "10.227.0.2"
            public_endpoint         = "34.66.86.167"
        }

        release_channel {
            channel = "REGULAR"
        }

        workload_identity_config {
            identity_namespace = "broad-cda-dev.svc.id.goog"
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @pshapiro4broad, Action: `pull_request`, Working Directory: `./cda`, Workflow: `Terraform Plan`*